[
  {"id":0,"leftButtonText": "First", "rightButtonText": "First", "questText": "Привет! Добро пожаловать в квест \"Хижина в лесу\".\nТы главный герой!\nТвоя задача выжить и выбраться из леса.\nВведи своё имя и начнем."},
  {"id":1,"leftButtonText": "Открыть дверь", "rightButtonText": "Уйти в лес", "questText": "Ты вышел в лес прогуляться и заблудился, спустя 4 часа попыток выбраться, ты замерз и проголодался. Силы на исходе, но ты не теряешь надежды и решаешь свернуть в сторону, пройдя около полу часа, в далеке ты увидел свет, и быстро устремился к нему. Перед тобой хижина, в дверь которой вставлен ключ. Осмотревшись вокруг и заглянув внутрь дома ты понял что в доме никого нет.\nЧто ты выберешь?"},
  {"id":2, "leftButtonText": "Поесть из холодильника", "rightButtonText": "Дождаться хозяина", "questText": "Здесь явно кто-то был совсем недавно: чайник на плите тёплый, в прихожей видны мокрые земляные следы от обуви, пахнет едой. Немного осмотревшись ты решил раздеться и согреться, урчание живота изводило, а запах еды ещё больше соблазнял на поиски еды.В небольшой комнатке стоял шкаф, кровать, стол и холодильник."},
  {"id":3, "leftButtonText": "Встретить и поговорить", "rightButtonText": "Убежать в лес", "questText": "Было вкусно, ты чувствуешь себя гораздо лучше. \nВ окне ты увидел прорисовывающийся в далеке силует мужчины, стало волнительно.\nЧто ты выберешь?"},
  {"id":4, "leftButtonText": "Начать новую игру", "rightButtonText": "Уйти в лес", "questText": "Хозяин очень недоволен что ты пробрался в его дом и опустошил холодильник, он выгнал тебя в лес"},
  {"id":5, "leftButtonText": "Начать новую игру", "rightButtonText": "Уйти в лес", "questText": "Ты встретил хозяина и попросил о помощи, вы пообщались, он угостил тебя ужином и предложил отвезти тебя в город. Ты прошёл квест!"},
  {"id":6, "leftButtonText": "Найти еду", "rightButtonText": "Продолжить ходить по лесу", "questText": "В лесу очень темно и холодно, слышны страшные звуки, ты ослаб и очень голоден... Тебя тревожат мысли о ночлежке в лесу, надежды на выживание становится всё меньше..."},
  {"id":7, "leftButtonText": "Съесть ягоды", "rightButtonText": "Съесть грибы", "questText": "Ты продрог от сырости и сильного голода, пора поесть, вокруг тебя много ягод и грибов..."},
  {"id":8, "leftButtonText": "Начать новую игру", "rightButtonText": "", "questText": "Ты чувствуешь себя намного лучше и отправился искать выход из леса, как вдруг ты услышал что кто-то быстро приближается к тебе. Это был волк. Ты погиб."},
  {"id":9, "leftButtonText": "Начать новую игру", "rightButtonText": "", "questText": "Ты погиб от ядовитых грибов..."},
  {"id":10, "leftButtonText": "Начать новую игру", "rightButtonText": "", "questText": "Сил становилось всё меньше, ты начал бредить и потерял сознание. Выжить не удалось. "}
]


